---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.BuiltInFailures.PartMakerMethodForWallFailures
source: html/52d06c2f-6ffd-e463-ea31-98ef896a54a6.htm
---
# BuiltInFailures.PartMakerMethodForWallFailures Members

Provides a container of all Revit built-in FailureDefinitionId instances.